app/controllers/produtos_controller.rb

  def index
    @produtos = if params[:term]
                  Produto.where('nome ILIKE ?', "%#{params[:term]}%").page(params['page']).per(3)
                else
                  Produto.all.page(params['page']).per(3)
---
SELECT  "produtos".* FROM "produtos" WHERE (nome ILIKE '%%') LIMIT $1 OFFSET $2  [["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "produtos" WHERE (nome ILIKE '%%')
SELECT  "produtos".* FROM "produtos" LIMIT $1 OFFSET $2  [["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "produtos"

  def meus_produtos
    @produtos = Produto.where('user_id = ?', "%#{params[:user]}%").page(params['page']).per(3)
---
SELECT  "produtos".* FROM "produtos" WHERE (user_id = '%%') LIMIT $1 OFFSET $2  [["LIMIT", 3], ["OFFSET", 0]]

  def create
    @produto = Produto.new(produto_params)
    @produto.user = current_user

    respond_to do |format|
      if @produto.save
---
INSERT INTO "produtos" ("nome", "preco", "desc", "created_at", "updated_at", "image", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["nome", "ASDSA"], ["preco", 12.0], ["desc", "dda"], ["created_at", "2019-08-15 14:11:10.383287"], ["updated_at", "2019-08-15 14:11:10.383287"], ["image", "atinfo.jpeg"], ["user_id", 1]]

  def update
    respond_to do |format|
      if @produto.update(produto_params)
---
UPDATE "produtos" SET "image" = $1, "updated_at" = $2 WHERE "produtos"."id" = $3  [["image", "Ventilador-de-Mesa-50cm-150W-Mondial-Turbo-Force-NVT-50-com-8-Pas-e-3-Velocidades-Preto-Prata-127V-1606336.jpg"], ["updated_at", "2019-08-16 14:12:22.886944"], ["id", 26]]

  def destroy
    respond_to do |format|
      if @produto.user == current_user
        @produto.destroy
---
DELETE FROM "produtos" WHERE "produtos"."id" = $1  [["id", 1]]